// 对于取余的问题,注意分析它的周期.
// 通过二项展开式,合并后,去掉所有a的指数大于等于2的项,就得到了%a^2的余数.
// 即 当n为偶数时,余数为2.否则为2*n*a.
// 显然,当n为奇数时,获得的余数更大.
int solve_120()
{
	int result = 0;
	for(int a = 3; a <= 1000; ++a)
	{	//1. 如果a是奇数,那么2*a*n = 2*a*(n+a) (mod a^2),即周期为a
		// 	 (注意不是n/2,因为这个值是个小数),所以n取任何奇偶数都可以.
		//   如果n是奇数,可以直接使用2*n*a,否则,可以通过+a转换为偶数.
		//2. 如果a是偶数,a/2为整数,那么2*a*n = 2*a*(n+a/2)(mod a^2),即
		//   周期为a/2.如果a/2为奇数,那么跟1一样,n可以取任何奇偶数都可以.
		//   如果a/2为偶数,那么n只可以取奇数,即(a/2) - 1.
		//满足了上述的奇偶条件,让2*a*n尽量接近n^2.
		//对于1和2中类似1的情况,取n为(a-1)/2就可以.保证了当a为奇数时,2n为a-1.
		//当a为偶数而a/2为奇数时,2n为a-2.
		//对于a为偶数同样a/2也为偶数时,n一定要是奇数(因为无法通过周期把它变为奇数),
		//所以n取仅小于(a/2)的数,即(a/2) - 1.
		// 综上:
		/*
		if(a % 2 != 0 || (a / 2 % 2) != 0)
			n = (a - 1) / 2;
		else
			n = (a / 2) - 1;
		*/
		// 因为(a / 2) - 1与(a - 1) / 2当a为偶数是相等的.
		// 因此,n = (a - 1) / 2.
		// 即:
		result += 2 * ((a - 1) / 2) * a;
	}
	return result;
}